<h1> <b>Pandas</b> </h1>

The data manipulation capabilities of pandas are built on top of the numpy library. In a way, numpy is a dependency of the pandas library.<br>
Pandas is best at handling tabular data sets comprising different variable types (integer, float, double, etc.). In addition, the pandas library can also be used to perform even the most naive of tasks such as loading data or doing feature engineering on time series data.<br>

In [2]:
import pandas as pd
import numpy as np

# **Core components of pandas: Series and DataFrames**

A Series is a data column<br>
DataFrame is a multi-dimensional table made up of a collection of Series<br>

In [3]:
#Create a Panda series
s = pd.Series([4, 3.5, 5, "HI", [1,2]])
s #print the dataframe

0         4
1       3.5
2         5
3        HI
4    [1, 2]
dtype: object

Create a series called:<br>
>towns<br>
With the following values:<br>
>"San Jose", "KaiserSlautern", "Bangkok", "Singapore"

In [4]:

towns = pd.Series(["San Jose", "KaiserSlautern", "Bangkok", "Singapore"])
towns

0          San Jose
1    KaiserSlautern
2           Bangkok
3         Singapore
dtype: object

**Create a dataframe from two or more series**<br>
Use the form: <br>

>pd.DataFrame({column name:series name, column name:series name})

In [5]:
city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'])
population = pd.Series([852469, 1015785, 485199])

pd.DataFrame({ 'City name': city_names, 'Population': population })

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199

Create a series of students names. The series should be 6 elements long. <br>
Create a series of students grades. The series should be 6 elements long<br>
Combine the two series into a DataFrame.

In [6]:

student_names = pd.Series(["John","Mike","Anil", "Arun", "Mala", "Maya"])
student_grades = pd.Series(["A", "A++","B++", "B+", "C"])
pd.DataFrame({"Student Name":student_names, "Student Grade": student_grades})

  Student Name Student Grade
0         John             A
1         Mike           A++
2         Anil           B++
3         Arun            B+
4         Mala             C
5         Maya           NaN

**Create a DataFrame with unequal lengths of series**
<br>
This dataframe will be used lated in this course.

In [7]:
#There are 7 names in the student_names series
student_names=pd.Series(["bob", "ted","alice","max","bill", "ida", "mark"])
#There are 5 id numbers in the student_id series
student_id=pd.Series([float("NaN"),112,113,114,115,116,])
#The two DataFrames can still be combined into a DataFrame
#Missing values are listed as NaN
student_info = pd.DataFrame({ 'name': student_names, 'id': student_id })
print(student_info)

    name     id
0    bob    NaN
1    ted  112.0
2  alice  113.0
3    max  114.0
4   bill  115.0
5    ida  116.0
6   mark    NaN

**Remove from the dataframe any values that are missing**

Use isna function to see the missing values<br>
If the value is True, the data is missing

In [8]:
student_info.isna()

    name     id
0  False   True
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False   True

**Drop the rows that contain missing values**

In [9]:
student_info.dropna()

    name     id
1    ted  112.0
2  alice  113.0
3    max  114.0
4   bill  115.0
5    ida  116.0

Create a series of student_weights with 5 elements<br>
Create a series of student_ages with 6 elements<br>
Combine the two series into one DataFrame. One column should be called Student Weight, the other column should be called Student Age<br>
Search for missing values

In [10]:

student_weights = pd.Series([50,60,70,35,45])
student_ages = pd.Series([12,14,87,59,9,20])
studentDF = pd.DataFrame({'Student Weight': student_weights, 'Student Age': student_ages})
studentDF.isna()

   Student Weight  Student Age
0           False        False
1           False        False
2           False        False
3           False        False
4           False        False
5            True        False

# **Create a dataframe from a CSV file**

Most of the time DataFrames are created from files. <br>
Use the Pandas read_csv command to read a CSV file and load it as a DataFrame.

In [11]:
california_housing_dataframe = pd.read_csv("https://download.mlcc.google.com/mledu-datasets/california_housing_train.csv", sep=",")
california_housing_dataframe

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0
...,...,...,...,...,...,...,...,...,...
16995,-124.26,40.58,52.0,2217.0,394.0,907.0,369.0,2.3571,111400.0
16996,-124.27,40.69,36.0,2349.0,528.0,1194.0,465.0,2.5179,79000.0
16997,-124.30,41.84,17.0,2677.0,531.0,1244.0,456.0,3.0313,103600.0
16998,-124.30,41.80,19.0,2672.0,552.0,1298.0,478.0,1.9797,85800.0
16999,-124.35,40.54,52.0,1820.0,300.0,806.0,270.0,3.0147,94600.0

**Print the last 5 rows in a dataset using the tail function. **

In [12]:
california_housing_dataframe.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

# **Selecting subsets of a dataframe**

**Listing the indexes for the dataframe**

In [15]:
#create a dataframe
df2 = pd.read_csv("oscarNoErrors.csv", sep=",",error_bad_lines=False)
df2.tail()

,Index,"""Year""","""Age""","""Name""","""Movie"""
84,85,2012,39,"""Jean Dujardin""","""The Artist"""
85,86,2013,55,"""Daniel Day-Lewis""","""Lincoln"""
86,87,2014,44,"""Matthew McConaughey""","""Dallas Buyers Club"""
87,88,2015,33,"""Eddie Redmayne""","""The Theory of Everything""\t"
88,89,2016,41,"""Leonardo DiCaprio""","""The Revenant"""

In [16]:
#create a variable index to hold the indexes
index = df2.index

In [17]:
#create a variable to hold the column names
columns1 = df2.columns
columns1

Index(['Index', ' "Year"', ' "Age"', ' "Name"', ' "Movie"'], dtype='object')

In [18]:
#create a variable to hold all the values of the dataframe
values = df2.values
values

array([[1, 1928, 44, ' "Emil Jannings"',
        ' "The Last Command The Way of All Flesh"'],
       [2, 1929, 41, ' "Warner Baxter"', ' "In Old Arizona"'],
       [3, 1930, 62, ' "George Arliss"', ' "Disraeli"'],
       [4, 1931, 53, ' "Lionel Barrymore"', ' "A Free Soul"'],
       [5, 1932, 47, ' "Wallace Beery"', ' "The Champ"'],
       [6, 1933, 35, ' "Fredric March"', ' "Dr. Jekyll and Mr. Hyde"'],
       [7, 1934, 34, ' "Charles Laughton"',
        ' "The Private Life of Henry VIII"'],
       [8, 1935, 34, ' "Clark Gable"', ' "It Happened One Night"'],
       [9, 1936, 49, ' "Victor McLaglen"', ' "The Informer"\t'],
       [10, 1937, 41, ' "Paul Muni"', ' "The Story of Louis Pasteur"\t'],
       [11, 1938, 37, ' "Spencer Tracy"', ' "Captains Courageous"'],
       [12, 1939, 38, ' "Spencer Tracy"', ' "Boys Town"'],
       [13, 1940, 34, ' "Robert Donat"', ' "Goodbye Mr. Chips"\t'],
       [14, 1941, 32, ' "James Stewart"', ' "The Philadelphia Story"'],
       [15, 1942, 40, ' "Gary Cooper"', ' "Sergeant York"'],
       [16, 1943, 43, ' "James Cagney"', ' "Yankee Doodle Dandy"\t'],
       [17, 1944, 48, ' "Paul Lukas"', ' "Watch on the Rhine"\t'],
       [18, 1945, 41, ' "Bing Crosby"', ' "Going My Way"'],
       [19, 1946, 39, ' "Ray Milland"', ' "The Lost Weekend" \t'],
       [20, 1947, 49, ' "Fredric March"',
        ' "The Best Years of Our Lives"'],
       [21, 1948, 57, ' "Ronald Colman"', ' "A Double Life"'],
       [22, 1949, 41, ' "Laurence Olivier"', ' "Hamlet"'],
       [23, 1950, 38, ' "Broderick Crawford"', ' "All the King\'s Men"'],
       [24, 1951, 39, ' "José Ferrer"', ' "Cyrano de Bergerac"'],
       [25, 1952, 52, ' "Humphrey Bogart"', ' "The African Queen"'],
       [26, 1953, 51, ' "Gary Cooper"', ' "High Noon"'],
       [27, 1954, 35, ' "William Holden"', ' "Stalag 17"'],
       [28, 1955, 30, ' "Marlon Brando"', ' "On the Waterfront"'],
       [29, 1956, 39, ' "Ernest Borgnine"', ' "Marty"'],
       [30, 1957, 36, ' "Yul Brynner"', ' "The King and I"'],
       [31, 1958, 43, ' "Alec Guinness"',
        ' "The Bridge on the River Kwai"'],
       [32, 1959, 49, ' "David Niven"', ' "Separate Tables"'],
       [33, 1960, 36, ' "Charlton Heston"', ' "Ben-Hur"'],
       [34, 1961, 47, ' "Burt Lancaster"', ' "Elmer Gantry"'],
       [35, 1962, 31, ' "Maximilian Schell"',
        ' "Judgment at Nuremberg"\t'],
       [36, 1963, 47, ' "Gregory Peck"', ' "To Kill a Mockingbird"'],
       [37, 1964, 37, ' "Sidney Poitier"', ' "Lilies of the Field"'],
       [38, 1965, 57, ' "Rex Harrison"', ' "My Fair Lady"'],
       [39, 1966, 42, ' "Lee Marvin"', ' "Cat Ballou"\t'],
       [40, 1967, 45, ' "Paul Scofield"', ' "A Man for All Seasons"'],
       [41, 1968, 42, ' "Rod Steiger"', ' "In the Heat of the Night"\t'],
       [42, 1969, 45, ' "Cliff Robertson"', ' "Charly"'],
       [43, 1970, 62, ' "John Wayne"', ' "True Grit"'],
       [44, 1971, 43, ' "George C. Scott"', ' "Patton"'],
       [45, 1972, 42, ' "Gene Hackman"', ' "The French Connection"'],
       [46, 1973, 48, ' "Marlon Brando"', ' "The Godfather"'],
       [47, 1974, 49, ' "Jack Lemmon"', ' "Save the Tiger"'],
       [48, 1975, 56, ' "Art Carney"', ' "Harry and Tonto"'],
       [49, 1976, 38, ' "Jack Nicholson"',
        ' "One Flew Over the Cuckoo\'s Nest"'],
       [50, 1977, 60, ' "Peter Finch"', ' "Network"'],
       [51, 1978, 30, ' "Richard Dreyfuss"', ' "The Goodbye Girl"'],
       [52, 1979, 40, ' "Jon Voight"', ' "Coming Home"'],
       [53, 1980, 42, ' "Dustin Hoffman"', ' "Kramer vs. Kramer"'],
       [54, 1981, 37, ' "Robert De Niro"', ' "Raging Bull"'],
       [55, 1982, 76, ' "Henry Fonda"', ' "On Golden Pond"'],
       [56, 1983, 39, ' "Ben Kingsley"', ' "Gandhi"'],
       [57, 1984, 53, ' "Robert Duvall"', ' "Tender Mercies"'],
       [58, 1985, 45, ' "F. Murray Abraham"', ' "Amadeus"'],
       [59, 1986, 36, ' "William Hurt"', ' "Kiss of the Spider Woman"'],
       [60, 1987, 62, ' "Paul Newman"', ' "The Color of Money"'],
       [61, 1988, 43, ' "Michael Douglas"', ' "Wall Street"'],
       [62, 1989, 51, ' "Dustin Hoffman"', ' "Rain Man"'],
       [63, 1990, 32, ' "Daniel Day-Lewis"', ' "My Left Foot"'],
       [64, 1991, 42, ' "Jeremy Irons"', ' "Reversal of Fortune"'],
       [65, 1992, 54, ' "Anthony Hopkins"',
        ' "The Silence of the Lambs"'],
       [66, 1993, 52, ' "Al Pacino"', ' "Scent of a Woman"'],
       [67, 1994, 37, ' "Tom Hanks"', ' "Philadelphia"'],
       [68, 1995, 38, ' "Tom Hanks"', ' "Forrest Gump"'],
       [69, 1996, 32, ' "Nicolas Cage"', ' "Leaving Las Vegas"'],
       [70, 1997, 45, ' "Geoffrey Rush"', ' "Shine"'],
       [71, 1998, 60, ' "Jack Nicholson"', ' "As Good as It Gets"'],
       [72, 1999, 46, ' "Roberto Benigni"', ' "Life Is Beautiful"'],
       [73, 2000, 40, ' "Kevin Spacey"', ' "American Beauty"'],
       [74, 2001, 36, ' "Russell Crowe"', ' "Gladiator"'],
       [75, 2002, 47, ' "Denzel Washington"', ' "Training Day"\t'],
       [76, 2003, 29, ' "Adrien Brody"', ' "The Pianist"'],
       [77, 2004, 43, ' "Sean Penn"', ' "Mystic River"'],
       [78, 2005, 37, ' "Jamie Foxx"', ' "Ray"'],
       [79, 2006, 38, ' "Philip Seymour Hoffman"', ' "Capote"'],
       [80, 2007, 45, ' "Forest Whitaker"',
        ' "The Last King of Scotland"\t'],
       [81, 2008, 50, ' "Daniel Day-Lewis"', ' "There Will Be Blood"'],
       [82, 2009, 48, ' "Sean Penn"', ' "Milk"'],
       [83, 2010, 60, ' "Jeff Bridges"', ' "Crazy Heart"'],
       [84, 2011, 50, ' "Colin Firth"', ' "The King\'s Speech"\t'],
       [85, 2012, 39, ' "Jean Dujardin"', ' "The Artist"'],
       [86, 2013, 55, ' "Daniel Day-Lewis"', ' "Lincoln"'],
       [87, 2014, 44, ' "Matthew McConaughey"', ' "Dallas Buyers Club"'],
       [88, 2015, 33, ' "Eddie Redmayne"',
        ' "The Theory of Everything"\t'],
       [89, 2016, 41, ' "Leonardo DiCaprio"', ' "The Revenant"']],
      dtype=object)


1. Create a Pandas dataframe using the California housing data<br>
2. Create a variable to hold the column housing_median_age
3. Create a variable to hold all the values in the dataset, without the column names.

In [19]:
california_housing_dataframe = pd.read_csv("https://download.mlcc.google.com/mledu-datasets/california_housing_train.csv", sep=",")
housing_median_age = california_housing_dataframe[["housing_median_age"]]
print(housing_median_age)

chdf = california_housing_dataframe.values
chdf

       housing_median_age
0                    15.0
1                    19.0
2                    17.0
3                    14.0
4                    20.0
...                   ...
16995                52.0
16996                36.0
16997                17.0
16998                19.0
16999                52.0

[17000 rows x 1 columns]

array([[-1.1431e+02,  3.4190e+01,  1.5000e+01, ...,  4.7200e+02,
         1.4936e+00,  6.6900e+04],
       [-1.1447e+02,  3.4400e+01,  1.9000e+01, ...,  4.6300e+02,
         1.8200e+00,  8.0100e+04],
       [-1.1456e+02,  3.3690e+01,  1.7000e+01, ...,  1.1700e+02,
         1.6509e+00,  8.5700e+04],
       ...,
       [-1.2430e+02,  4.1840e+01,  1.7000e+01, ...,  4.5600e+02,
         3.0313e+00,  1.0360e+05],
       [-1.2430e+02,  4.1800e+01,  1.9000e+01, ...,  4.7800e+02,
         1.9797e+00,  8.5800e+04],
       [-1.2435e+02,  4.0540e+01,  5.2000e+01, ...,  2.7000e+02,
         3.0147e+00,  9.4600e+04]])

**To select a columns of the dataframe**

In [20]:
#create a dataframe
df2 = pd.read_csv("oscarNoErrors.csv", sep=",",error_bad_lines=False)
df2[[' "Name"',' "Year"']]

                    "Name"   "Year"
0          "Emil Jannings"     1928
1          "Warner Baxter"     1929
2          "George Arliss"     1930
3       "Lionel Barrymore"     1931
4          "Wallace Beery"     1932
..                     ...      ...
84         "Jean Dujardin"     2012
85      "Daniel Day-Lewis"     2013
86   "Matthew McConaughey"     2014
87        "Eddie Redmayne"     2015
88     "Leonardo DiCaprio"     2016

[89 rows x 2 columns]

# **The .loc indexer**
The .loc indexer selects data in a different way than just the indexing operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns. Most importantly, it only selects data by the LABEL of the rows and columns.<br><br>

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

In [21]:
#the .loc will return a single row of data when given the index of the row
#It returns a dataframe when the columns names are now the index values
print(california_housing_dataframe.columns)
print("\n")
#columns
california_housing_dataframe.loc[:,'total_rooms']

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

0        5612.0
1        7650.0
2         720.0
3        1501.0
4        1454.0
          ...
16995    2217.0
16996    2349.0
16997    2677.0
16998    2672.0
16999    1820.0
Name: total_rooms, Length: 17000, dtype: float64

In [22]:
#rows - use index values to identify rows
df2 = pd.read_csv("oscarNoErrors.csv", sep=",",error_bad_lines=False)
print("returns a series: \n",df2.loc[84])
print("\n\nreturns a dataframe: \n")
df2.loc[[84]]

returns a series:
 Index                     85
 "Year"                 2012
 "Age"                    39
 "Name"      "Jean Dujardin"
 "Movie"        "The Artist"
Name: 84, dtype: object


returns a dataframe:

    Index   "Year"   "Age"            "Name"        "Movie"
84     85     2012      39   "Jean Dujardin"   "The Artist"


1. Using the california housing data
2.Create a dataframe from indexed rows 5-10<br><br>

In [23]:
california_housing_dataframe.loc[5:10]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
5,-114.58,33.63,29.0,1387.0,236.0,671.0,239.0,3.3438,74000.0
6,-114.58,33.61,25.0,2907.0,680.0,1841.0,633.0,2.6768,82400.0
7,-114.59,34.83,41.0,812.0,168.0,375.0,158.0,1.7083,48500.0
8,-114.59,33.61,34.0,4789.0,1175.0,3134.0,1056.0,2.1782,58400.0
9,-114.60,34.83,46.0,1497.0,309.0,787.0,271.0,2.1908,48100.0
10,-114.60,33.62,16.0,3741.0,801.0,2434.0,824.0,2.6797,86500.0

Using the california housing data<br>
Create a dataframe from indexed rows 2-6 and longitude	and latitude columns

In [24]:
df = california_housing_dataframe.loc[2:6]
df[['longitude', 'latitude']]

   longitude  latitude
2    -114.56     33.69
3    -114.57     33.64
4    -114.57     33.57
5    -114.58     33.63
6    -114.58     33.61

# **The .iloc indexer**
the iloc indexer is similar .loc, but .iloc only uses integer locations. <br><br>
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html

In [25]:
#select a single row
print(df2.iloc[30])
print("\n")
print(df2.iloc[:,3])
print("\n")
df2.iloc[4:7,2:5]

Index                                    31
 "Year"                                1958
 "Age"                                   43
 "Name"                     "Alec Guinness"
 "Movie"     "The Bridge on the River Kwai"
Name: 30, dtype: object


0            "Emil Jannings"
1            "Warner Baxter"
2            "George Arliss"
3         "Lionel Barrymore"
4            "Wallace Beery"
               ...
84           "Jean Dujardin"
85        "Daniel Day-Lewis"
86     "Matthew McConaughey"
87          "Eddie Redmayne"
88       "Leonardo DiCaprio"
Name:  "Name", Length: 89, dtype: object

    "Age"               "Name"                            "Movie"
4      47      "Wallace Beery"                        "The Champ"
5      35      "Fredric March"          "Dr. Jekyll and Mr. Hyde"
6      34   "Charles Laughton"   "The Private Life of Henry VIII"

In [26]:
#select multiple rows
df2.iloc[[44,55,60]]

    Index   "Year"   "Age"              "Name"                   "Movie"
44     45     1972      42      "Gene Hackman"   "The French Connection"
55     56     1983      39      "Ben Kingsley"                  "Gandhi"
60     61     1988      43   "Michael Douglas"             "Wall Street"


Using the california housing data and iloc<br>
Create a dataframe from indexed rows 2-6 and longitude	and latitude columns

In [27]:
#, Using iloc
california_housing_dataframe.iloc[2:6, 0:2]

   longitude  latitude
2    -114.56     33.69
3    -114.57     33.64
4    -114.57     33.57
5    -114.58     33.63


Print the first 5 rows of the california_housing_dataframe. <br>
Use the head *function*

In [28]:
california_housing_dataframe.head()
california_housing_dataframe.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

**Once data is in a Pandas dataframe, it can be manipulated with Pandas commands.**

In the example below, print all the sections where the houses have a median age less than or equal to 20.

In [29]:
column_name = california_housing_dataframe["housing_median_age"]
young_age = california_housing_dataframe.loc[(column_name<=20) ]
young_age.count()

longitude             5209
latitude              5209
housing_median_age    5209
total_rooms           5209
total_bedrooms        5209
population            5209
households            5209
median_income         5209
median_house_value    5209
dtype: int64



List all the sections where the median_income is greater than 3

In [30]:
column_name = california_housing_dataframe["median_income"]
median_income = california_housing_dataframe.loc[(column_name > 3) ]
print(median_income.count())
print(median_income)

longitude             10923
latitude              10923
housing_median_age    10923
total_rooms           10923
total_bedrooms        10923
population            10923
households            10923
median_income         10923
median_house_value    10923
dtype: int64
       longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
3        -114.57     33.64                14.0       1501.0           337.0
5        -114.58     33.63                29.0       1387.0           236.0
13       -114.61     34.83                31.0       2478.0           464.0
23       -114.98     33.82                15.0        644.0           129.0
25       -115.32     32.82                34.0        591.0           139.0
...          ...       ...                 ...          ...             ...
16986    -124.19     40.73                21.0       5694.0          1056.0
16992    -124.23     40.81                52.0       1112.0           209.0
16993    -124.23     40.54                52.0       2694.0           453.0
16997    -124.30     41.84                17.0       2677.0           531.0
16999    -124.35     40.54                52.0       1820.0           300.0

       population  households  median_income  median_house_value
3           515.0       226.0         3.1917             73400.0
5           671.0       239.0         3.3438             74000.0
13         1346.0       479.0         3.2120             70400.0
23          137.0        52.0         3.2097             71300.0
25          327.0        89.0         3.6528            100000.0
...           ...         ...            ...                 ...
16986      2907.0       972.0         3.5363             90100.0
16992       544.0       172.0         3.3462             50800.0
16993      1152.0       435.0         3.0806            106700.0
16997      1244.0       456.0         3.0313            103600.0
16999       806.0       270.0         3.0147             94600.0

[10923 rows x 9 columns]

**Pandas allows you to combine 2 or more data conditions**

In [31]:
condition1_series1 = california_housing_dataframe["housing_median_age"]<=20
condition1_series2 = california_housing_dataframe["median_income"]> 3.0

california_housing_dataframe.loc[(condition1_series1<=20) & (condition1_series2)]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
5,-114.58,33.63,29.0,1387.0,236.0,671.0,239.0,3.3438,74000.0
13,-114.61,34.83,31.0,2478.0,464.0,1346.0,479.0,3.2120,70400.0
23,-114.98,33.82,15.0,644.0,129.0,137.0,52.0,3.2097,71300.0
25,-115.32,32.82,34.0,591.0,139.0,327.0,89.0,3.6528,100000.0
...,...,...,...,...,...,...,...,...,...
16986,-124.19,40.73,21.0,5694.0,1056.0,2907.0,972.0,3.5363,90100.0
16992,-124.23,40.81,52.0,1112.0,209.0,544.0,172.0,3.3462,50800.0
16993,-124.23,40.54,52.0,2694.0,453.0,1152.0,435.0,3.0806,106700.0
16997,-124.30,41.84,17.0,2677.0,531.0,1244.0,456.0,3.0313,103600.0
16999,-124.35,40.54,52.0,1820.0,300.0,806.0,270.0,3.0147,94600.0

In [32]:
california_housing_dataframe.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

List all the sections of california_house_dataframe that:
1. That have less than 200 bedrooms
2. And have a median income greater than 4.0

In [33]:
bedroomsLessThan200 = california_housing_dataframe["total_bedrooms"] < 200
medIncomeMoreThan4 = california_housing_dataframe["median_income"] > 4

california_housing_dataframe.loc[bedroomsLessThan200 & medIncomeMoreThan4]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
32,-115.39,32.76,16.0,1136.0,196.0,481.0,185.0,6.2558,146300.0
95,-115.58,32.81,5.0,805.0,143.0,458.0,143.0,4.4750,96300.0
113,-115.80,33.26,2.0,96.0,18.0,30.0,16.0,5.3374,47500.0
116,-115.88,32.93,15.0,208.0,49.0,51.0,20.0,4.0208,32500.0
129,-116.02,34.18,8.0,569.0,97.0,312.0,96.0,4.3021,94500.0
...,...,...,...,...,...,...,...,...,...
16589,-122.70,38.35,16.0,1328.0,187.0,607.0,197.0,5.0366,257800.0
16665,-122.77,38.92,26.0,712.0,140.0,293.0,100.0,4.0119,119400.0
16744,-122.91,39.17,44.0,202.0,42.0,142.0,39.0,4.3500,68300.0
16779,-123.01,38.67,33.0,914.0,147.0,394.0,132.0,4.6875,246200.0
16944,-124.14,40.67,23.0,580.0,117.0,320.0,109.0,4.2054,130600.0

# **Check for missing data and count them**

1. Create a function that returns the sum of all the missing values
2. Apply the functon to the dataset

In [34]:
#Create a new function:
def num_missing(x):
  return sum(x.isnull())

#Applying per column:
print ("Missing values per column:")
#axis=0 defines that function is to be applied on each column
print (california_housing_dataframe.apply(num_missing, axis=0)) 


#Applying per row:
print ("\nMissing values per row:")
 #axis=1 defines that function is to be applied on each row
print (california_housing_dataframe.apply(num_missing, axis=1).head())

Missing values per column:
longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

Missing values per row:
0    0
1    0
2    0
3    0
4    0
dtype: int64

Use the dataframe called student_info<br>
Use the num_missing function to list the missing data

In [35]:
def value_missing(x):
  return sum(x.isna())
print(student_info)
print(student_info.apply(value_missing, axis=0))
print(student_info.apply(value_missing, axis=1))

    name     id
0    bob    NaN
1    ted  112.0
2  alice  113.0
3    max  114.0
4   bill  115.0
5    ida  116.0
6   mark    NaN
name    0
id      2
dtype: int64
0    1
1    0
2    0
3    0
4    0
5    0
6    1
dtype: int64


Fix the missing values and run the num_missing function again.

In [36]:
student_info.iloc[0,1] = 56
student_info.iloc[6,1] = 65
print(student_info)
print(student_info.apply(value_missing, axis=0))
print(student_info.apply(value_missing, axis=1))

    name     id
0    bob   56.0
1    ted  112.0
2  alice  113.0
3    max  114.0
4   bill  115.0
5    ida  116.0
6   mark   65.0
name    0
id      0
dtype: int64
0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# **Using Pandas with Problem CSV Files**

Sometimes there are problems with a CSV file and you may not even be able to read it in correctly. 
For example in the example below when trying to read in a CSV file, an error occurs.

In [39]:
df2 = pd.read_csv("deniro.csv", sep = ',')
df2

    Year   Score             Title
0   1968      86       "Greetings"
1   1970      17     "Bloody Mama"
2   1970      73         "Hi Mom!"
3   1971      40     "Born to Win"
4   1973      98    "Mean Streets"
..   ...     ...               ...
82  2014       9     "The Bag Man"
83  2015      60             "Joy"
84  2015      26           "Heist"
85  2015      61      "The Intern"
86  2016      11   "Dirty Grandpa"

[87 rows x 3 columns]

1. Figure out what lines were skipped and why. <br>
Hint: 
use cat to read the file<br>
2. Add those lines to the dataframe

<br>
As an example: I have added a row to the dataframe for you.

In [40]:
#Print the column names with the columns command
df2.columns

Index(['Year', ' Score', ' Title'], dtype='object')

In [41]:
#Create a dataFrame for the new row
df_add = pd.DataFrame([[1970, 73, "Hi Mom!"], [1974,  97, "The Godfather Part II"], [1977,  67, "New York New York"]], columns =(['Year', ' Score', ' Title']))
df_add

   Year   Score                  Title
0  1970      73                Hi Mom!
1  1974      97  The Godfather Part II
2  1977      67      New York New York

In [42]:
#append the two dataFrames
df3 = df2.append(df_add,sort=True, ignore_index=True)
df3

     Score                  Title  Year
0       86            "Greetings"  1968
1       17          "Bloody Mama"  1970
2       73              "Hi Mom!"  1970
3       40          "Born to Win"  1971
4       98         "Mean Streets"  1973
..     ...                    ...   ...
85      61           "The Intern"  2015
86      11        "Dirty Grandpa"  2016
87      73                Hi Mom!  1970
88      97  The Godfather Part II  1974
89      67      New York New York  1977

[90 rows x 3 columns]

In [43]:
#Sort the dataframe by Year
df3.sort_values(by='Year')

     Score             Title  Year
0       86       "Greetings"  1968
1       17     "Bloody Mama"  1970
2       73         "Hi Mom!"  1970
87      73           Hi Mom!  1970
3       40     "Born to Win"  1971
..     ...               ...   ...
82       9     "The Bag Man"  2014
83      60             "Joy"  2015
84      26           "Heist"  2015
85      61      "The Intern"  2015
86      11   "Dirty Grandpa"  2016

[90 rows x 3 columns]

**DataFrames can be Sorted by an axis:**<br>

In [44]:
df3.sort_index(axis=1, ascending=False)

    Year                  Title   Score
0   1968            "Greetings"      86
1   1970          "Bloody Mama"      17
2   1970              "Hi Mom!"      73
3   1971          "Born to Win"      40
4   1973         "Mean Streets"      98
..   ...                    ...     ...
85  2015           "The Intern"      61
86  2016        "Dirty Grandpa"      11
87  1970                Hi Mom!      73
88  1974  The Godfather Part II      97
89  1977      New York New York      67

[90 rows x 3 columns]


Load the file called oscar_winners.csv into a Pandas DataFrame. 
Fix any problems you encounter.

In [45]:
#@title 
df2 = pd.read_csv("oscar_winners.csv", sep=",",error_bad_lines=False, skipinitialspace = True, quotechar='"')
df2

,Index,Year,Age,Name,Movie
0,1,1928,44,Emil Jannings,"The Last Command, The Way of All Flesh"
1,2,1929,41,Warner Baxter,In Old Arizona
2,3,1930,62,George Arliss,Disraeli
3,4,1931,53,Lionel Barrymore,A Free Soul
4,5,1932,47,Wallace Beery,The Champ
...,...,...,...,...,...
84,85,2012,39,Jean Dujardin,The Artist
85,86,2013,55,Daniel Day-Lewis,Lincoln
86,87,2014,44,Matthew McConaughey,Dallas Buyers Club
87,88,2015,33,Eddie Redmayne,The Theory of Everything\t
88,89,2016,41,Leonardo DiCaprio,The Revenant


1. Read the letter_frequency.csv file. <br>
> It has the letter, number of times the letter appears in a document, and the percentage of the frequency of the letter. <br>

2. Print all the *vowels* whose frequency is greater than the frequency of the letter 'U'.

In [46]:
dataframe = pd.read_csv("letter_frequency.csv", sep=",",error_bad_lines=False) 
print(dataframe)
frequencyOfU = dataframe.at[20,' "Frequency"']
#print(frequencyOfU)

def checkFrequency(item):
  #print('============',item[0])
  if(item[0] == '    "A"' or item[0] == '    "E"' or item[0] == '    "I"' or item[0] == '    "O"'):
    #print("frequency of ", item[0], " = ", item[1])
    if(item[1] > frequencyOfU):
      #print('Frequency greater')
      return item[0]

print("=============Below are the vowels whose frequency is greater than the frequency of the letter 'U'.=============")
print(dataframe.apply(checkFrequency, axis=1))

     Letter   "Frequency"   "Percentage"
0       "A"      24373121            8.1
1       "B"       4762938            1.6
2       "C"       8982417            3.0
3       "D"      10805580            3.6
4       "E"      37907119           12.6
5       "F"       7486889            2.5
6       "G"       5143059            1.7
7       "H"      18058207            6.0
8       "I"      21820970            7.3
9       "J"        474021            0.2
10      "K"       1720909            0.6
11      "L"      11730498            3.9
12      "M"       7391366            2.5
13      "N"      21402466            7.1
14      "O"      23215532            7.7
15      "P"       5719422            1.9
16      "Q"        297237            0.1
17      "R"      17897352            5.9
18      "S"      19059775            6.3
19      "T"      28691274            9.5
20      "U"       8022379            2.7
21      "V"       2835696            0.9
22      "W"       6505294            2.2
23      "X"        562732            0.2
24      "Y"       5910495            2.0
25      "Z"         93172            0.0
=============Below are the vowels whose frequency is greater than the frequency of the letter 'U'.=============
0         "A"
1        None
2        None
3        None
4         "E"
5        None
6        None
7        None
8         "I"
9        None
10       None
11       None
12       None
13       None
14        "O"
15       None
16       None
17       None
18       None
19       None
20       None
21       None
22       None
23       None
24       None
25       None
dtype: object


**When reading in CSV files, you must really understand your data **<br><br>
Load letter_frequency.csv into a dataframe.<br>
1. Print out the column names<br>
>print(dataframe-name.columns)<br>
2. Print out a row<br>
>print(dataframe-name.loc[[row#]])<br>
3. Print out a specific value<br>
>dataframe-name.at[row#, column name]

**Categorizing Variables**

In [47]:
#Create a dataframe
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                              'corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

**Referencing columns by name and index**

In [48]:
#data.loc[: , "food"]
data[data.columns[0]]

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

Add a column that contains a variable for the source of food.

In [49]:
#Step 1: create dictionary to map the food-source relationship
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [ ]:
#create a new variable
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

In [50]:
#Or add the new variable using the assign function
#Notice with this method I created a new dataframe
new_data = data.assign(family_serving = data['ounces']*10)
new_data

          food  ounces  family_serving
0        bacon     4.0            40.0
1  pulled pork     3.0            30.0
2        bacon    12.0           120.0
3     Pastrami     6.0            60.0
4  corned beef     7.5            75.0
5        Bacon     8.0            80.0
6     pastrami     3.0            30.0
7    honey ham     5.0            50.0
8     nova lox     6.0            60.0

**Drop a column**

In [51]:
new_data.drop('family_serving',axis='columns',inplace=True)
new_data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0



1. Use the testTitanic.csv file to create a dataframe. <br>
survival - Survival (0 = No; 1 = Yes)<br>
class - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)<br>
name - Name<br>
sex - Sex<br>
age - Age<br>
sibsp - Number of Siblings/Spouses Aboard<br>
parch - Number of Parents/Children Aboard<br>
ticket - Ticket Number<br>
fare - Passenger Fare<br>
cabin - Cabin<br>
embarked - Port of Embarkation <br>
(C = Cherbourg; Q = Queenstown; S = Southampton)<br>
<br>

2. Add a column for citizenship based on embark point. <br>
>April 10, 1912 Passengers in Southampton, England, board the ship. <br>
April 11, 1912 after stopping in France the Titanic picks up more passengers in Queenstown, Ireland<br>

3. Drop the SibSp column

In [52]:
dataframe = pd.read_csv("testTitanic.csv", sep=",",error_bad_lines=False) 
embarkToCitizenship = {
    'Q': 'Ireland',
    'S': 'England',
    'C': 'France'
}
dataframe['Citizenship'] = dataframe['Embarked'].map(embarkToCitizenship)

dataframe.drop('SibSp',axis='columns',inplace=True)
dataframe

,PassengerId,Pclass,Name,Sex,Age,Parch,Ticket,Fare,Cabin,Embarked,Citizenship
0,892,3,"Kelly, Mr. James",male,34.5,0,330911,7.8292,NaN,Q,Ireland
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,0,363272,7.0000,NaN,S,England
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,240276,9.6875,NaN,Q,Ireland
3,895,3,"Wirz, Mr. Albert",male,27.0,0,315154,8.6625,NaN,S,England
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,3101298,12.2875,NaN,S,England
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,A.5. 3236,8.0500,NaN,S,England
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,PC 17758,108.9000,C105,C,France
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,SOTON/O.Q. 3101262,7.2500,NaN,S,England
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,359309,8.0500,NaN,S,England
417,1309,3,"Peter, Master. Michael J",male,NaN,1,2668,22.3583,NaN,C,France

**Rename Columns and Row**

In [53]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

**Use the rename function**<br>
Rename a row using the rename function

In [54]:
#Using rename function
data.rename(index = {'Ohio':'Iowa'}, columns={'one':'one_p','two':'two_p'},inplace=True)
data

          one_p  two_p  three  four
Iowa          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

**Rename a column**<br>
Rename a column using the rename function

In [55]:
#Using rename function
data.rename(columns={'one':'one_p','two':'two_p'},inplace=True)
data

          one_p  two_p  three  four
Iowa          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

Use the rename function to change the case for a column

In [56]:
#Use the string function with the rename function
data.rename(index = str.upper, columns=str.title,inplace=True)
data

          One_P  Two_P  Three  Four
IOWA          0      1      2     3
COLORADO      4      5      6     7
NEW YORK      8      9     10    11


1. Use the testTitanic.csv file to create a dataframe. <br>
2. Change the values in the Sex column to:<br>
>M for Male, F for female

**Binning continuous variables**<br>

In [57]:
#Create a series
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 120, 32]

Create bins for each age range

In [58]:
#Understanding the output - 
#'(' means the value is included in the bin, 
#'[' means the value is excluded

bins = [18, 25, 35, 60, 100, 120]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (100, 120], (25, 35]]
Length: 12
Categories (5, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100] < (100, 120]]

In [60]:
pd.value_counts(cats)

(18, 25]      5
(25, 35]      3
(35, 60]      2
(100, 120]    1
(60, 100]     1
dtype: int64

In [59]:
bin_names = ['Youth', 'YoungAdult', 'MiddleAge', 'Senior', 'Ancient']
new_cats = pd.cut(ages, bins,labels=bin_names)

pd.value_counts(new_cats)

Youth         5
YoungAdult    3
MiddleAge     2
Ancient       1
Senior        1
dtype: int64

In [61]:
#Cumulative Sum
pd.value_counts(new_cats).cumsum()

Youth          5
YoungAdult     8
MiddleAge     10
Ancient       11
Senior        12
dtype: int64


1. Use the testTitanic.csv file to create a dataframe. <br>
2. Bin the ages of the passengers

# **Writing to an Excel Spreadsheet**
The code to write to an Excel speadsheet is fairly straight foward: <br>
1. Create a Pandas dataframe
2. Create a pathname to the .xlsx file
3. Use the builtin method to_excel<br><Br>

I do not have Excel, so I cannot check that this code actually produces something that you would want...but it does create a file with an .xlsx extension.

In [62]:
## convert your array into a dataframe
dataframe = pd.read_csv("letter_frequency.csv", quotechar='"', skipinitialspace=True, sep=",",error_bad_lines=False) 

## save to xlsx file
filepath = 'my_excel_file.xlsx'

dataframe.to_excel(filepath, index=False)